# -*- coding:utf-8 -*-
a = {
  "rating": {
    "max": 10,
    "numRaters": 63,
    "average": "8.2",
    "min": 0
  },
  "subtitle": "",
  "author": [
    "希利尔"
  ],
  "pubdate": "2007-8",
  "tags": [
    {
      "count": 122,
      "name": "运筹学",
      "title": "运筹学"
    },
    {
      "count": 75,
      "name": "数学",
      "title": "数学"
    },
    {
      "count": 33,
      "name": "管理学",
      "title": "管理学"
    },
    {
      "count": 21,
      "name": "管理",
      "title": "管理"
    },
    {
      "count": 20,
      "name": "经济",
      "title": "经济"
    },
    {
      "count": 20,
      "name": "教材",
      "title": "教材"
    },
    {
      "count": 13,
      "name": "金融工程",
      "title": "金融工程"
    },
    {
      "count": 11,
      "name": "清华教材",
      "title": "清华教材"
    }
  ],
  "origin_title": "",
  "image": "https://img3.doubanio.com/view/subject/m/public/s5839395.jpg",
  "binding": "",
  "translator": [
    "胡运权"
  ],
  "catalog": "前言n第1章 绪论n第2章 运筹学建模方法综述n第3章 线性规划导论n第4章 求解线性规划问题——单纯形法n第5章 单纯形法理论n第6章 对偶理论与灵敏度分析n第7章 线性规划的其他算法n第8章 运输和指派问题n第9章 网络优化模型n第10章 动态规划n第11章 整数规划n第12章 非线性规划n第13章 元启发方法n第14章 博弈论n第15章 决策分析n第16章 马尔可夫链n第17章 排队论n第18章 存储论n第19章 马尔可夫决策过程n第20章 模拟n部分习题答案",
  "pages": "989",
  "images": {
    "small": "https://img3.doubanio.com/view/subject/s/public/s5839395.jpg",
    "large": "https://img3.doubanio.com/view/subject/l/public/s5839395.jpg",
    "medium": "https://img3.doubanio.com/view/subject/m/public/s5839395.jpg"
  },
  "alt": "https://book.douban.com/subject/2253276/",
  "id": "2253276",
  "publisher": "运筹学",
  "isbn10": "7302151202",
  "isbn13": "9787302151203",
  "title": "运筹学导论",
  "url": "https://api.douban.com/v2/book/2253276",
  "alt_title": "",
  "author_intro": "弗雷德里克·S.希利尔（Fredexick S.Hillier）在美国华盛顿州的Aberdeen诞生和成长，他曾在全州高中的作文写作、数学、辩论和音乐比赛中获奖。作为斯坦福大学的本科生，他在超过3O0名学生的工程班级中名列第一。他因技术写作获McKinsey奖，在斯坦福woodwind Q1Jintet的表现获杰出的二年级大学生辩论奖，因在工程和人文社会科学结合上的优异成绩获Hamilton奖。当他毕业并获工业工程理学士时，获得了三项奖学金（国家科学基金、陶·贝塔·派、丹福斯）用于在斯坦福大学运筹学专业的研究生学习。获博士学位后，他留斯坦福大学任教，并同时获得康奈尔大学、卡内基·梅隆大学、丹麦技术大学、新西兰坎特布里大学、英国剑桥大学的访问邀请。在斯坦福大学任教35年后，他于1996年提前退休以便集中精力从事专著的写作，现为斯坦福大学运筹学的名誉教授。n希利尔博士的研究涉及很多领域，包括整数规划、排队论及其应用、统计质量管理以及应用运筹学于资金预算及生产系统设计。他的论著领域广泛，他的一些充满活力的论文至少10次以上被选人有关专著重新出版。他是由美国管理科学研究所（TIMS（和美国海军研究署资助的“互相关联项目资金预算”研究竞赛的首位获奖者。他和杰拉尔德·J.利伯曼博士还因本书第6版获美国运筹和管理科学学会1995年度的兰切斯特（Larlchester）奖的荣誉提名奖，该奖项是各类运筹学英语出版物的最高奖。n希利尔博士在他所在的领域的专业协会中担任过很多领导职务，例如曾任美国运筹学会（ORSA）的司库，TIMS会议的副主席，1989年在日本大阪举行的TIMS国际会议的合作总主持人，TIMS出版委员会主席，美国运筹学会运筹学选题编委会主席，美国运筹学会资源计划委员会主席，美国运筹学会和美国管理科学研究所联合会议委员会主席，美国运筹学与管理科学研究会（IMFORMS）John von Neumann理论奖评选委员会主席。目前他担任Kluwer科学出版社运筹学和管理科学国际系列出版物的编辑。n除了《运筹学导论》和其他两本配套出版物《数学规划导论》（第2版，1995)和《运筹学随机模型导论》（1990），他的著作还有《风险关联的投资评估》（N0rth Holland，1969），《排队论的表和图》（Elsevier N0rth Holland，1981，合著者有0.S.尤、D.M.爱维斯、L.D.福赛特、F.D.罗和M.I.雷曼）及《管理科学导论：运用电子表格的建模与案例研究方法》（第2版，McGraw Hill／Irwin2003，合著者有M.S希利尔）。",
  "summary": "《运筹学导论(第8版)》是运筹学经典著作，在美国高校有很高的采用率。两位作者是运筹学领域的大师。本书内容丰富，覆盖运筹学各个分支，主要内容包括：运筹学建模方法、线性规划、灵敏度分析与对偶理论、网络优化模型、排队论、动态规n划等。内容的讲述深入浅出，使具有高等数学和线性代数、概率基础知识的读者均能读懂。",
  "price": "98.00元"
}
print (a)